local F, C = unpack(select(2, ...))

C.NameplateAuraWhiteList = {
    -- Buffs
    [642]    = true, -- 圣盾术
    [1022]   = true, -- 保护之手
    [23920]  = true, -- 法术反射
    [45438]  = true, -- 寒冰屏障
    [186265] = true, -- 灵龟守护
    -- Debuffs
    [2094]   = true, -- 致盲
    [10326]  = true, -- 超度邪恶
    [20549]  = true, -- 战争践踏
    [107079] = true, -- 震山掌
    [117405] = true, -- 束缚射击
    [127797] = true, -- 乌索尔旋风
    [272295] = true, -- 悬赏
    -- Mythic+
    [228318] = true, -- 激怒
    [226510] = true, -- 血池
    [343553] = true, -- 万噬之怨
    [343502] = true, -- 鼓舞光环
    -- Dungeons
    [113315] = true, -- 青龙寺，强烈
    [113309] = true, -- 青龙寺，至高能量
    [384148] = true, -- 诱捕陷阱，蕨皮
    [200672] = true, -- 水晶迸裂，巢穴
    [377724] = true, -- 小怪易伤，提尔
    [413027] = true, -- 泰坦之壁，永恒黎明
    [258653] = true, -- 魂能壁垒，阿塔达萨
    [255960] = true, -- 强效巫毒，阿塔达萨
    [255967] = true, -- 强效巫毒，阿塔达萨
    [255968] = true, -- 强效巫毒，阿塔达萨
    [255970] = true, -- 强效巫毒，阿塔达萨
    [255972] = true, -- 强效巫毒，阿塔达萨
    [260805] = true, -- 聚焦之虹，庄园
    [264027] = true, -- 结界蜡烛，庄园
    [372824] = true, -- 燃烧锁链，奈萨鲁斯
    -- TWW S1
    [343558] = true, -- 通灵战潮，病态凝视
    [343470] = true, -- 通灵战潮，碎骨之盾
    [328351] = true, -- 通灵战潮，染血长枪
    [323149] = true, -- 仙林，黑暗之拥
    [322569] = true, -- 仙林，兹洛斯之手
}

C.NameplateAuraBlackList = {
    [15407] = true,  -- 精神鞭笞
    [51714] = true,  -- 锋锐之霜
    [199721] = true, -- 腐烂光环
    [214968] = true, -- 死灵光环
    [214975] = true, -- 抑心光环
    [273977] = true, -- 亡者之握
    [276919] = true, -- 承受压力
    [206930] = true, -- 心脏打击
}

C.NameplateShowTargetNPCsList = {
    [165251] = true, -- 仙林狐狸
    [174773] = true, -- 怨毒怪
}

C.TrashUnitsList = {
    [174773] = true, -- 大米，怨毒影魔
    [190174] = true, -- 催眠蝙蝠，S4
    [166589] = true, -- 活化武器，赤红
    [169753] = true, -- 饥饿的虱子，赤红
    [175677] = true, -- 走私来的生物，集市
    [190407] = true, -- 水波暴怒者，注能大厅
}

C.SpecialUnitsList = {
    -- TWW S1

    -- 宝库
    [212453] = true, -- 阴森的虚空之魂
    [221979] = true, -- 虚缚嗥狼
    [214443] = true, -- 水晶碎片
    [224962] = true, -- 咒炉愈疗者
    [214287] = true, -- 爆地图腾
    [213338] = true, -- 炉铸愈疗者

    -- 仙林
    [164921] = true, -- 德鲁斯特收割者
    [165251] = true, -- 幻影仙狐
    [166275] = true, -- 纱雾塑形者
    [166299] = true, -- 纱雾照看者
    [167111] = true, -- 锥喉鹿角巨虫
    [165560] = true, -- 戈姆蛴幼虫

    -- 通灵
    [166302] = true, -- 尸体收割者
    [165222] = true, -- 佐尔拉姆斯愈骨者
    [165919] = true, -- 骷髅劫掠者
    [163126] = true, -- 脆骨法师
    [165872] = true, -- 血肉工匠
    [173016] = true, -- 尸体采集者
    [173044] = true, -- 缝合助理

    -- 围攻
    [129370] = true, -- 铁潮塑浪者
    [129367] = true, -- 水鼠帮唤风者

    -- 破晨号
    [214762] = true, -- 夜幕司令官
    [213893] = true, -- 夜幕暗法师

    -- 格瑞姆巴托
    [224219] = true, -- 暮光唤地者
    [40167]  = true, -- 暮光欺诈者
    [224271] = true, -- 暮光术士
    [40357]  = true, -- 被召唤的暗影烈焰之灵

    -- 回响
    [216293] = true, -- 颤声侍从
    [217531] = true, -- 伊克辛
    [218961] = true, -- 饥饿爬蛛
    [223253] = true, -- 沾血的网法师
    [216340] = true, -- 哨兵鹿壳虫
    [220599] = true, -- 沾血的网法师

    -- 千丝
    [220195] = true, -- 苏雷吉缚丝者
    [220196] = true, -- 安苏雷克的传令官
    [216339] = true, -- 苏雷吉反自然者
    [219198] = true, -- 贪婪的甲虫
}

C.PowerUnitsList = {
    [56792] = true,  -- 青龙寺，怀疑臆象
    [165556] = true, -- 赤红深渊，瞬息具象
    [171557] = true, -- 猎手阿尔迪莫，巴加斯特之影
    [163746] = true, -- 垃圾场，步行震击者X1型
    [114247] = true, -- 卡上，馆长
}

C.MajorSpellsList = {
    -- TWW S1
    [76711] = true,  -- 灼烧心智，格瑞姆巴托
    [451871] = true, -- 剧烈震颤，格瑞姆巴托
    [256957] = true, -- 防水甲壳，围攻伯拉勒斯
    [275826] = true, -- 强化怒吼，围攻伯拉勒斯
    [322938] = true, -- 收割精魂，塞茲仙林的迷雾
    [324776] = true, -- 木棘外壳，塞茲仙林的迷雾
    [326046] = true, -- 模拟抗性，塞茲仙林的迷雾
    [340544] = true, -- 再生鼓舞，塞茲仙林的迷雾
    [321828] = true, -- 肉饼蛋糕，塞茲仙林的迷雾
    [340160] = true, -- 辐光之息，塞茲仙林的迷雾
    [324293] = true, -- 刺耳尖啸，通灵战潮
    [338357] = true, -- 暴捶，通灵战潮
    [320596] = true, -- 深重呕吐，通灵战潮
    [327130] = true, -- 修复血肉，通灵战潮
    [328667] = true, -- 寒冰箭雨，通灵战潮
    [334749] = true, -- 排干体液，通灵战潮
    [335143] = true, -- 接骨，通灵战潮
    [338353] = true, -- 瘀液喷撒，通灵战潮
    [433841] = true, -- 毒液箭雨，回响之城
    [434793] = true, -- 共振弹幕，回响之城
    [434802] = true, -- 惊惧尖鸣，回响之城
    [448248] = true, -- 恶臭齐射，回响之城
    [443430] = true, -- 流丝缠缚，千丝之城
    [446086] = true, -- 虚空之波，千丝之城
    [452162] = true, -- 愈合之网，千丝之城
    [432520] = true, -- 暗影屏障，破晨号
    [450756] = true, -- 深渊嗥叫，破晨号
    [451097] = true, -- 流丝护壳，破晨号
    [429109] = true, -- 愈合金属，矶石宝库
    [429545] = true, -- 噤声齿轮，矶石宝库
    [445207] = true, -- 穿透哀嚎，矶石宝库
    [449455] = true, -- 咆哮恐惧，矶石宝库
}
